### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [50]:
# Dependencies and Setup
import pandas as pd


# File to Load (Remember to Change These)
school_data_to_load ="C:/Users/smile/PythonStuff/Pandas_Challenge/Resources/schools_complete.csv"
student_data_to_load ="C:/Users/smile/PythonStuff/Pandas_Challenge/Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Calculate the percentage of students who passed math **and** reading (% Overall Passing)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [51]:
total_schools=school_data['School ID'].count()
total_schools

15

In [34]:
total_students=school_data['size'].sum()
total_students

39170

In [35]:
total_budget=school_data['budget'].sum()
# total_budgetf=total_budget.map('${:,.2f}'.format)
total_budget

24649428

In [5]:
# Read School and Student Data File and store into Pandas DataFrames
student_data = pd.read_csv(student_data_to_load)
student_data.head(1)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79

In [6]:
avg_math=student_data['math_score'].mean()
avg_math

78.98537145774827

In [7]:
avg_reading=student_data['reading_score'].mean()
avg_reading

81.87784018381414

In [16]:
passing_math=student_data[student_data['math_score']>=70].count()["student_name"]
passing_math_perc=round((passing_math/total_students)*100,6)  
passing_math_perc

74.980853

In [92]:
passing_reading=student_data[student_data['reading_score']>=70].count()["student_name"]
passing_reading_perc=round((passing_reading/total_students)*100,6)  
passing_reading_perc

85.805463

In [93]:
overall=student_data[(student_data['math_score']>=70)&(student_data['reading_score']>=70)].count()["student_name"]
overall=round((overall/total_students)*100,6)
overall

65.172326

In [97]:
# Total_schools_to_Overall_Passing
district_summary=pd.DataFrame({"Total Schools": [total_schools],
                               "Total Students": [total_students],
                               "Total Budget": [total_budget],
                               "Average Math Score": [avg_math],
                               "Average Reading Score": [avg_reading],
                               "% Passing Math":[passing_math_perc],
                               "% Overall Passing": [overall]
                              }
                             )
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,65.172326

In [98]:
district_summary['Total Budget']=district_summary['Total Budget'].map("${:,.2f}".format)
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Overall Passing
0,15,39170,"$24,649,428.00",78.985371,81.87784,74.980853,65.172326

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

In [54]:
#School Name
school_name=school_data['school_name'].unique()
school_name

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [60]:
#School Type
school_type=school_data[["school_name","type", "size","budget"]].head()
school_type

             school_name      type  size   budget
0      Huang High School  District  2917  1910635
1   Figueroa High School  District  2949  1884411
2    Shelton High School   Charter  1761  1056600
3  Hernandez High School  District  4635  3022020
4    Griffin High School   Charter  1468   917500

In [63]:
students_school=school_data['size']
students_school.head()

0    2917
1    2949
2    1761
3    4635
4    1468
Name: size, dtype: int64

In [66]:
budget_per_student=school_data["budget"]/students_school
school_data['budget_per-student']=budget_per_student
school_data.head()

,School ID,school_name,type,size,budget,budget_per-student
0,0,Huang High School,District,2917,1910635,655.0
1,1,Figueroa High School,District,2949,1884411,639.0
2,2,Shelton High School,Charter,1761,1056600,600.0
3,3,Hernandez High School,District,4635,3022020,652.0
4,4,Griffin High School,Charter,1468,917500,625.0

In [90]:
# Combine the data into a single dataset.  
#Merge school and students
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,budget_per-student
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635,655.0
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635,655.0
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635,655.0
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635,655.0
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635,655.0

In [120]:
# Set school as index, get type, total students, total budget and per student budget
#make school an index?
grouped=student_data.groupby("school_name")
grouped.count().head()

,Student ID,student_name,gender,grade,reading_score,math_score
school_name,,,,,,
Bailey High School,4976,4976,4976,4976,4976,4976
Cabrera High School,1858,1858,1858,1858,1858,1858
Figueroa High School,2949,2949,2949,2949,2949,2949
Ford High School,2739,2739,2739,2739,2739,2739
Griffin High School,1468,1468,1468,1468,1468,1468

In [106]:
grouped.get_group('Bailey High School')

       Student ID         student_name gender grade  reading_score  math_score
17871       17871         Blake Martin      M   9th             75          59
17872       17872         Kathryn Kane      F  12th             84          58
17873       17873         Richard Haas      M  11th             79          86
17874       17874          Frank Marsh      M   9th             71          89
17875       17875  Charles Goodman Jr.      M   9th             90          61
...           ...                  ...    ...   ...            ...         ...
22842       22842         Jaclyn Ayala      F  12th             74          93
22843       22843       Jennifer Tapia      F  12th             79          56
22844       22844       Gabriel Ashley      M   9th             95          88
22845       22845         Sarah Cooper      F  10th             91          62
22846       22846  Dr. Nicholas Garcia      M  11th             90          79

[4976 rows x 6 columns]

In [129]:
#groupby to get Average math Score by school

avg_grouped_math=pd.DataFrame(grouped['math_score'].mean())
avg_grouped_math.head()

                      math_score
school_name
Bailey High School     77.048432
Cabrera High School    83.061895
Figueroa High School   76.711767
Ford High School       77.102592
Griffin High School    83.351499

In [128]:
#groupby to get Average reading Score by school

avg_grouped_reading=pd.DataFrame(grouped['reading_score'].mean())
avg_grouped_reading.head()

                      reading_score
school_name
Bailey High School        81.033963
Cabrera High School       83.975780
Figueroa High School      81.158020
Ford High School          80.746258
Griffin High School       83.816757

In [134]:
#% passing math by school
all_passing_math=school_data_complete[school_data_complete['math_score']>=70].count()["math_score"]
all_passing_math_perc=round((all_passing_math/total_students)*100,6)  
all_passing_math_perc

74.980853

## Top Performing Schools (By % Overall Passing)

In [ ]:
#groupby to get Average Reading Score by school

* Sort and display the top five performing schools by % overall passing.

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

## Scores by School Size

* Perform the same operations as above, based on school size.

## Scores by School Type

* Perform the same operations as above, based on school type